server/app/controllers/authentication_controller.rb

    def login							# POST /auth/login
        @user = User.find_by_email(login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@email.com"], ["LIMIT", 1]]